# Student Data
This notebook analyizes pass/fail data for class

In [248]:
names = ['Dan','Joann','Pedro','Rosie','Ethan','Vicky','Frederic','Jimmie','Rhonda','Giovanni','Francesca','Rajab','Naiyana','Kian','Jenny','Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha','Bill','Ted']
print(names)

['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny', 'Jakeem', 'Helena', 'Ismat', 'Anila', 'Skye', 'Daniel', 'Aisha', 'Bill', 'Ted']

In [249]:
hours = [10,11.5,9,16,9.25,1,11.5,9,8.5,14.5,15.5,13.75,9,8,15.5,8,9,6,10,12,12.5,12,8,float('nan')]
print (hours)

[10, 11.5, 9, 16, 9.25, 1, 11.5, 9, 8.5, 14.5, 15.5, 13.75, 9, 8, 15.5, 8, 9, 6, 10, 12, 12.5, 12, 8, nan]

In [250]:
scores = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64,float('nan'),float('nan')]
print (scores)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, nan, nan]

In [251]:
import numpy as np
np_names = np.array(names)
np_hours = np.array(hours)
np_scores = np.array(scores)

In [252]:
np_names.shape

(24,)

In [253]:
np_scores.shape

(24,)

In [254]:
np_hours.shape

(24,)

In [255]:
import pandas as pd

In [256]:
df = pd.DataFrame({
    "Names": np_names,
    "Hours": np_hours,
    "Scores": np_scores
})

In [257]:
print(df)

        Names  Hours  Scores
0         Dan  10.00    50.0
1       Joann  11.50    50.0
2       Pedro   9.00    47.0
3       Rosie  16.00    97.0
4       Ethan   9.25    49.0
5       Vicky   1.00     3.0
6    Frederic  11.50    53.0
7      Jimmie   9.00    42.0
8      Rhonda   8.50    26.0
9    Giovanni  14.50    74.0
10  Francesca  15.50    82.0
11      Rajab  13.75    62.0
12    Naiyana   9.00    37.0
13       Kian   8.00    15.0
14      Jenny  15.50    70.0
15     Jakeem   8.00    27.0
16     Helena   9.00    36.0
17      Ismat   6.00    35.0
18      Anila  10.00    48.0
19       Skye  12.00    52.0
20     Daniel  12.50    63.0
21      Aisha  12.00    64.0
22       Bill   8.00     NaN
23        Ted    NaN     NaN

In [258]:
dataset_path="/Users/mikeyom/Documents/JuypterNotebook/datascience/z_data"

In [259]:
df_students = pd.read_csv(f"{dataset_path}/student.csv")

In [260]:
print(df_students)

         Name  Hours  Score
0         Dan  10.00   50.0
1       Joann  11.50   50.0
2       Pedro   9.00   47.0
3       Rosie  16.00   97.0
4       Ethan   9.25   49.0
5       Vicky   1.00    3.0
6    Frederic  11.50   53.0
7      Jimmie   9.00   42.0
8      Rhonda   8.50   26.0
9    Giovanni  14.50   74.0
10  Francesca  15.50   82.0
11      Rajab  13.75   62.0
12    Naiyana   9.00   37.0
13       Kian   8.00   15.0
14      Jenny  15.50   70.0
15     Jakeem   8.00   27.0
16     Helena   9.00   36.0
17      Ismat   6.00   35.0
18      Anila  10.00   48.0
19       Skye  12.00   52.0
20     Daniel  12.50   63.0
21      Aisha  12.00   64.0
22       Bill   8.00    NaN
23        Ted    NaN    NaN

In [261]:
df_students.isnull()

     Name  Hours  Score
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False
12  False  False  False
13  False  False  False
14  False  False  False
15  False  False  False
16  False  False  False
17  False  False  False
18  False  False  False
19  False  False  False
20  False  False  False
21  False  False  False
22  False  False   True
23  False   True   True

In [262]:
df_students.isnull().sum()

Name     0
Hours    1
Score    2
dtype: int64

In [263]:
df_students.Hours.mean()

np.float64(10.41304347826087)

In [264]:
dyHours = df_students.Hours.fillna(df_students.Hours.mean())

In [265]:
dyHours

0     10.000000
1     11.500000
2      9.000000
3     16.000000
4      9.250000
5      1.000000
6     11.500000
7      9.000000
8      8.500000
9     14.500000
10    15.500000
11    13.750000
12     9.000000
13     8.000000
14    15.500000
15     8.000000
16     9.000000
17     6.000000
18    10.000000
19    12.000000
20    12.500000
21    12.000000
22     8.000000
23    10.413043
Name: Hours, dtype: float64

In [266]:
dyStudy = df_students.Score.fillna(df_students.Score.mean())

In [267]:
ave_hours = df_students.Hours.mean()
ave_hours

np.float64(10.41304347826087)

In [268]:
ave_score = df_students.Score.mean()
ave_score

np.float64(49.18181818181818)

In [269]:
dyStudy

0     50.000000
1     50.000000
2     47.000000
3     97.000000
4     49.000000
5      3.000000
6     53.000000
7     42.000000
8     26.000000
9     74.000000
10    82.000000
11    62.000000
12    37.000000
13    15.000000
14    70.000000
15    27.000000
16    36.000000
17    35.000000
18    48.000000
19    52.000000
20    63.000000
21    64.000000
22    49.181818
23    49.181818
Name: Score, dtype: float64

In [270]:
df_students

         Name  Hours  Score
0         Dan  10.00   50.0
1       Joann  11.50   50.0
2       Pedro   9.00   47.0
3       Rosie  16.00   97.0
4       Ethan   9.25   49.0
5       Vicky   1.00    3.0
6    Frederic  11.50   53.0
7      Jimmie   9.00   42.0
8      Rhonda   8.50   26.0
9    Giovanni  14.50   74.0
10  Francesca  15.50   82.0
11      Rajab  13.75   62.0
12    Naiyana   9.00   37.0
13       Kian   8.00   15.0
14      Jenny  15.50   70.0
15     Jakeem   8.00   27.0
16     Helena   9.00   36.0
17      Ismat   6.00   35.0
18      Anila  10.00   48.0
19       Skye  12.00   52.0
20     Daniel  12.50   63.0
21      Aisha  12.00   64.0
22       Bill   8.00    NaN
23        Ted    NaN    NaN

In [271]:
df_students_drop = df_students.dropna(axis=0)

In [272]:
df_students_drop

         Name  Hours  Score
0         Dan  10.00   50.0
1       Joann  11.50   50.0
2       Pedro   9.00   47.0
3       Rosie  16.00   97.0
4       Ethan   9.25   49.0
5       Vicky   1.00    3.0
6    Frederic  11.50   53.0
7      Jimmie   9.00   42.0
8      Rhonda   8.50   26.0
9    Giovanni  14.50   74.0
10  Francesca  15.50   82.0
11      Rajab  13.75   62.0
12    Naiyana   9.00   37.0
13       Kian   8.00   15.0
14      Jenny  15.50   70.0
15     Jakeem   8.00   27.0
16     Helena   9.00   36.0
17      Ismat   6.00   35.0
18      Anila  10.00   48.0
19       Skye  12.00   52.0
20     Daniel  12.50   63.0
21      Aisha  12.00   64.0

In [273]:
df_students = df_students.fillna(df_students.mean(numeric_only=True))

In [274]:
df_students

         Name      Hours      Score
0         Dan  10.000000  50.000000
1       Joann  11.500000  50.000000
2       Pedro   9.000000  47.000000
3       Rosie  16.000000  97.000000
4       Ethan   9.250000  49.000000
5       Vicky   1.000000   3.000000
6    Frederic  11.500000  53.000000
7      Jimmie   9.000000  42.000000
8      Rhonda   8.500000  26.000000
9    Giovanni  14.500000  74.000000
10  Francesca  15.500000  82.000000
11      Rajab  13.750000  62.000000
12    Naiyana   9.000000  37.000000
13       Kian   8.000000  15.000000
14      Jenny  15.500000  70.000000
15     Jakeem   8.000000  27.000000
16     Helena   9.000000  36.000000
17      Ismat   6.000000  35.000000
18      Anila  10.000000  48.000000
19       Skye  12.000000  52.000000
20     Daniel  12.500000  63.000000
21      Aisha  12.000000  64.000000
22       Bill   8.000000  49.181818
23        Ted  10.413043  49.181818

In [275]:
print(f'Average weekly study hours: {ave_hours:.2f}')
print(f'Average score: {ave_score:.2f}')

Average weekly study hours: 10.41
Average score: 49.18